1s/ERP/extensions/liko/InformationRegisters/ТССтатистикаСкорости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТССтатистикаСкорости</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтбору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КРазмещению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтветственныеЛицаОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/Лико_ВидыОпераций_ПередачаСоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ВидыОпераций_ПередачаСоСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаВРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписаниеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаМОЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеНаОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Catalogs/РабочиеЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РабочиеЦентры</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МаксимальнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасценкаПереналадка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентВремениРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасценкаРабота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛикоЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/extensions/liko/CommonModules/Лико_ОбщегоНазначенияСервер/Ext/Module.bsl
//&Вместо("СоздатьРедактироватьВозвратСырьяДавальцу")
Процедура Лико_СоздатьРедактироватьВозвратСырьяДавальцу2(Документ, ЗаказКлиента, Заказчик, Знач Выпуск, Отказ)

	ДокументСсылка=НайтиДокумент("ВозвратСырьяДавальцу","Лико_Документ",Документ);

	Если  ДокументСсылка<>Неопределено Тогда
		ДокументОбъект=ДокументСсылка.ПолучитьОбъект();
	Иначе
		ДокументОбъект= Документы.ВозвратСырьяДавальцу.СоздатьДокумент();
	КонецЕсли;       


	ЗаказДавальца=НайтиДокумент("ЗаказДавальца","Лико_ЗаказКлиента",ЗаказКлиента);

	Если ЗаказДавальца=Неопределено Тогда
		Отказ=Истина;
		Возврат;
	КонецЕсли;


	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаЕвр = Константы.ВалютаУправленческогоУчета.Получить();


	Если ЗначениеЗаполнено(ЗаказДавальца) Тогда          

		//Массив = Новый Массив();
		//Массив.Добавить(ЗаказДавальца);
		//Структура = Новый Структура;
		//Структура.Вставить("МассивЗаказов",Массив);
		ДокументОбъект.Заполнить(ЗаказДавальца);
		//ЗаполнитьЗначенияСвойств(ДокументОбъект,ЗаказДавальца,,"Номер,Дата,Ссылка");
		//ДокументОбъект.ЗаказДавальца=ЗаказДавальца;                   
	КонецЕсли;
	ДокументОбъект.Лико_Документ=Документ;
	ДокументОбъект.Лико_НеНужныДвиженияОрдерныхСкладов=Истина;
	Тз=Выпуск;
	Если ЗначениеЗаполнено(ЗаказДавальца) Тогда
		Тз.Колонки.Добавить("ЗаказДавальца");
	КонецЕсли;
	Для каждого СтрТЗ Из Тз Цикл
		Если ЗначениеЗаполнено(ЗаказДавальца) Тогда
			СтрТЗ.ЗаказДавальца= ЗаказДавальца;
		КонецЕсли;                                         
	КонецЦикла;
	//НовоеРаспоряжение.Валюта=Валюта;
	ДокументОбъект.Комментарий = ""  + "Создан автоматически на основании документа """ + Документ + """";
	ДокументОбъект.Дата=Документ.Дата;

	ФизЛицо = Документ.АвторДокумента; 
	//ФизЛицо = УправлениеСвойствами.ЗначениеСвойства(ДокументОбъект.Организация,"Лико_ФизЛицоПриПередачеВЭксплуатацию");

	ДокументОбъект.Отпустил = ФизЛицо;
	ДокументОбъект.ОтпустилДолжность = Лико_Дополнительно.НайтиДолжностьФизЛица(ДокументОбъект.Отпустил, ДокументОбъект.Организация, ДокументОбъект.Дата);
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ОтпустилДолжность) Тогда
		ДокументОбъект.ОтпустилДолжность = "Кладовщик";
	КонецЕсли;
	ДокументОбъект.ПометкаУдаления=Ложь;
	ДокументОбъект.Менеджер = ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.Руководитель = Лико_Дополнительно.НайтиЛицоСПравомПодписи(ДокументОбъект.Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ФизЛицо, ДокументОбъект.Дата); 
	ДокументОбъект.ГлавныйБухгалтер = Лико_Дополнительно.НайтиЛицоСПравомПодписи(ДокументОбъект.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, ФизЛицо, ДокументОбъект.Дата); 

	//ДокументОбъект.ГлавныйБухгалтер = Лико_Дополнительно.НайтиЛицоСПравомПодписи(ДокументОбъект.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, ДокументОбъект.Отпустил, ДокументОбъект.Дата); 
	//ДляДокумента=ПолучитьСтруктуруДляЗаполненияТиповыхДокументов();
	//НовоеРаспоряжение.Договор       =ДляДокумента.Договор;              
	//НовоеРаспоряжение.Основание                      =НовоеРаспоряжение.Договор.Наименование;
	//НовоеРаспоряжение.ОснованиеДата            =НовоеРаспоряжение.Договор.Дата;
	//НовоеРаспоряжение.ОснованиеНомер=НовоеРаспоряжение.Договор.Номер;


	ДокументОбъект.Основание="Возврат неиспользованного давальческого сырья по заказу № "+ЗаказКлиента.НомерБезПрефикса+". Договор №"+СокрЛП(ДокументОбъект.Договор.Номер)+" от " +Формат(ДокументОбъект.Договор.Дата,"ДЛФ=D")+"г." ;
	Если ЗначениеЗаполнено(ЗаказДавальца) Тогда
		Тз.Свернуть("Номенклатура,Характеристика,ЗаказДавальца","Количество,КоличествоУпаковок");
	Иначе
		Тз.Свернуть("Номенклатура,Характеристика","Количество,КоличествоУпаковок"); 
	КонецЕсли;
	ДокументОбъект.Валюта=ВалютаРуб;


	//+ Лико m.shenderov 15.09.2019
	Тз=Документ.Товары.Выгрузить(,"Номенклатура,Характеристика,Серия,Количество,Цена");

	Для каждого СтрТз Из Тз Цикл
		ЗаказДавальцаПоступление=ЗаказДавальца;

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|              Лико_ПередачаТоваровТовары.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
		|              ПередачаСырьяПереработчику.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|              Документ.ПоступлениеСырьяОтДавальца КАК ПередачаСырьяПереработчику
		|                             ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
		|                             ПО (Лико_ПередачаТоваровТовары.Ссылка = ПередачаСырьяПереработчику.Лико_Документ)
		|ГДЕ
		|              Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = &ВидОперации
		|              И Лико_ПередачаТоваровТовары.Серия = &Серия
		|              И Лико_ПередачаТоваровТовары.Ссылка.Проведен
		|              И Лико_ПередачаТоваровТовары.Ссылка.Дата < &Дата
		|              И НЕ Лико_ПередачаТоваровТовары.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|              Лико_ПередачаТоваровТовары.Ссылка.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|              ЗаказДавальца.Ссылка КАК ЗаказДавальца,
		|              Вт.Ссылка КАК Ссылка
		|ИЗ
		|              Вт КАК Вт
		|                             ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказДавальца КАК ЗаказДавальца
		|                             ПО Вт.ЗаказКлиента = ЗаказДавальца.Лико_ЗаказКлиента
		|ГДЕ
		|              ЗаказДавальца.Проведен
		|              И НЕ ЗаказДавальца.ПометкаУдаления";
		Запрос.УстановитьПараметр("ВидОперации",Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку);
		Запрос.УстановитьПараметр("Серия",СтрТЗ.Серия);
		Запрос.УстановитьПараметр("Дата",Документ.Дата);

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		ПоступлениеСырьяОтДавальца=Неопределено;
		Пока Выборка.Следующий() Цикл                       
			ЗаказДавальцаПоступление=Выборка.ЗаказДавальца; 
			ПоступлениеСырьяОтДавальца=Выборка.Ссылка;
		КонецЦикла; 

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|              ПередачаСырьяПереработчикуТовары.Цена КАК Цена
		|ИЗ
		|              Документ.ПоступлениеСырьяОтДавальца.Товары КАК ПередачаСырьяПереработчикуТовары
		|ГДЕ
		|              ПередачаСырьяПереработчикуТовары.Номенклатура = &Номенклатура
		|              И ВЫБОР
		|                                             КОГДА &ПоПоступлениюСырьяОтДавальца
		|                                                             ТОГДА ПередачаСырьяПереработчикуТовары.Ссылка = &ПоступлениеСырьяОтДавальца
		|                                             ИНАЧЕ ПередачаСырьяПереработчикуТовары.ЗаказДавальца = &ЗаказДавальца
		|                             КОНЕЦ";
		Запрос.УстановитьПараметр("Номенклатура",СтрТЗ.Номенклатура);
		Запрос.УстановитьПараметр("ЗаказДавальца",ЗаказДавальцаПоступление);
		Запрос.УстановитьПараметр("ПоПоступлениюСырьяОтДавальца",ЗначениеЗаполнено(ПоступлениеСырьяОтДавальца));
		Запрос.УстановитьПараметр("ПоступлениеСырьяОтДавальца",ПоступлениеСырьяОтДавальца);

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрТЗ.Цена=Выборка.Цена;
		КонецЦикла;    
	КонецЦикла;

	Тз.Свернуть("Номенклатура,Характеристика,Цена","Количество");

	//- Лико m.shenderov 15.09.2019


	ДокументОбъект.Товары.Загрузить(Тз); 
	Для каждого СтрокаТовары Из ДокументОбъект.Товары Цикл            

		СтрокаТовары.ЗаказДавальца=ЗаказДавальца;
		СтрокаТовары.КоличествоУпаковок=СтрокаТовары.Количество;






		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму");
		//СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ДокументОбъект.НалогообложениеНДС);
		//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", ЗаказДавальца.ЦенаВключаетНДС, ЗаказДавальца.СтавкаНДС));
		//СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТовары, СтруктураДействий, Неопределено);

	КонецЦикла;

	ДокументОбъект.Товары.Сортировать("Номенклатура,Характеристика"); 
	ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина); 
	Попытка                                                             
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);                                                  
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + ДокументОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());

	КонецПопытки;



КонецПроцедуры

&Вместо("ПроверкаСвойствТМЦ")
Функция Лико_ПроверкаСвойствТМЦ(НоменклатураПроверки, ВидТМЦ, ВидСекции, ЦеноваяГруппа)


	Результат				=	"";

	ЦеноваяГруппаПроверки	=	НоменклатураПроверки.ЦеноваяГруппа; 	
	ВидТМЦПроверки			=	НоменклатураПроверки.Лико_видТМЦ;  

	Если ЦеноваяГруппаПроверки=ЦеноваяГруппа Тогда

		Возврат Результат;

	КонецЕсли;


	Если  ВидТМЦПроверки<>ВидТМЦ Тогда

		Результат=Результат+СтрШаблон("Не соответствует вид ТМЦ, требуется : ""%1"". ",ВидТМЦ);

	КонецЕсли;	

	Если  ЦеноваяГруппа.Лико_ВидыСекций.Найти(ВидСекции)=Неопределено Тогда

		Результат=Результат+СтрШаблон("Не соответствует вид работ (для вида секции)  требуется : ""%1"". ",ВидСекции);

	КонецЕсли;

	Если ЗначениеЗаполнено(ЦеноваяГруппа.Лико_Глянцевость) и  ЦеноваяГруппа.Лико_Глянцевость<>ЦеноваяГруппаПроверки.Лико_Глянцевость Тогда

		Результат=Результат+СтрШаблон("Не соответствует Глянцевость, требуется:""%1"". ",ЦеноваяГруппа.Лико_Глянцевость);

	КонецЕсли;

	Если ЗначениеЗаполнено(ЦеноваяГруппа.Лико_Основа) и  ЦеноваяГруппа.Лико_Основа<>ЦеноваяГруппаПроверки.Лико_Основа Тогда

		Результат=Результат+СтрШаблон("Не соответствует Основа,  требуется : ""%1"". ",ЦеноваяГруппа.Лико_Основа);

	КонецЕсли;   

	Если  ЦеноваяГруппа.Лико_ТУ<>ЦеноваяГруппаПроверки.Лико_ТУ Тогда

		Результат=Результат+СтрШаблон("Не соответствует применение, %1 ""ТУ"". ",?(ЦеноваяГруппа.Лико_ТУ,"требуется","не требуется"))  ;

	КонецЕсли;

	Возврат Результат;

КонецФункции

&Вместо("ПланРаботЗпПериод")
Функция Лико_ПланРаботЗпПериод(НачалоПериода, КонецПериода, СписокМашин)
	
	УстановитьПривилегированныйРежим(Истина);
	СписокНомеровМашин= Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(СписокМашин) Тогда
		ОтображениеРабочихЦентров=СписокМашин;
	Иначе
		ОтображениеРабочихЦентров=УправлениеСвойствами.ЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь,Справочники.Лико_ПредопределенныеЗначения.ДопРеквизитПользователяОтображениеРабочихЦентров.ЗначениеПараметра);
	КонецЕсли;
	
	СписокНомеровМашин= Новый СписокЗначений;
	//ОтображениеРабочихЦентров=УправлениеСвойствами.ЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь,Справочники.Лико_ПредопределенныеЗначения.ДопРеквизитПользователяОтображениеРабочихЦентров.ЗначениеПараметра);
	Если ЗначениеЗаполнено(ОтображениеРабочихЦентров) Тогда
		Для каждого РЦ Из ОтображениеРабочихЦентров.РабочиеЦентры Цикл
			СписокНомеровМашин.Добавить(Рц.РабочийЦентр.ПорядковыйНомер);
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|             ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказа
	|ИЗ
	|             РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|                             ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|                             ПО ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование = ЗаказКлиента.Ссылка
	|                             ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ОтображениеРабочихЦентров.РабочиеЦентры КАК Лико_ОтображениеРабочихЦентровРабочиеЦентры
	|                             ПО ПооперационноеРасписание2_2.РабочийЦентр = Лико_ОтображениеРабочихЦентровРабочиеЦентры.РабочийЦентр
	|ГДЕ
	|             Лико_ОтображениеРабочихЦентровРабочиеЦентры.Ссылка = &ОтображениеРабочихЦентров
	|И          ПооперационноеРасписание2_2.Выполнено = 0
	|И НЕ ПооперационноеРасписание2_2.Моделирование 
	//|         И НЕ(ПооперационноеРасписание2_2.Начало > &Дата2
	|             И                                            ПооперационноеРасписание2_2.Окончание < &Дата1";
	Запрос.УстановитьПараметр("Дата1",НачалоПериода );
	Запрос.УстановитьПараметр("Дата2",КонецПериода+20*24*60*60 );
	Запрос.УстановитьПараметр("ОтображениеРабочихЦентров",ОтображениеРабочихЦентров);
	
	
	НомераЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерЗаказа");
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|             ТССтатистикаСкорости.РабочийЦентр КАК РабочийЦентр,
	|             МАКСИМУМ(ТССтатистикаСкорости.ДатаНачала) КАК ДатаНачала
	|ПОМЕСТИТЬ ВТ_ДатыПоследнихЗаписейМашин
	|ИЗ
	|             РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|ГДЕ
	|             ТССтатистикаСкорости.РабочийЦентр <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|             ТССтатистикаСкорости.РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|             ТССтатистикаСкорости.РабочийЦентр КАК РабочийЦентр,
	|             ТССтатистикаСкорости.ДатаНачала КАК ДатаНачала,
	|             МАКСИМУМ(ТССтатистикаСкорости.ПорядковыйНомер) КАК ПорядковыйНомер
	|ПОМЕСТИТЬ ВТ_ДатыПоследнихЗаписейМашинСПорядковымНомером
	|ИЗ
	|             ВТ_ДатыПоследнихЗаписейМашин КАК ВТ_ДатыПоследнихЗаписейМашин
	|                             ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|                             ПО ВТ_ДатыПоследнихЗаписейМашин.РабочийЦентр = ТССтатистикаСкорости.РабочийЦентр
	|                                             И ВТ_ДатыПоследнихЗаписейМашин.ДатаНачала = ТССтатистикаСкорости.ДатаНачала
	|
	|СГРУППИРОВАТЬ ПО
	|             ТССтатистикаСкорости.РабочийЦентр,
	|             ТССтатистикаСкорости.ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|             ТССтатистикаСкорости.РабочийЦентр КАК РабочийЦентр,
	|             ТССтатистикаСкорости.Заказ КАК Заказ,
	|             ТССтатистикаСкорости.НомерБланка КАК НомерБланка,
	|             ТССтатистикаСкорости.ЭтапПроизводства КАК ЭтапПроизводства,
	|             ТССтатистикаСкорости.ДатаНачала КАК ДатаНачала,
	|             ТССтатистикаСкорости.ПорядковыйНомер КАК ПорядковыйНомер,
	|             ТССтатистикаСкорости.СтатусЗаказа КАК СтатусЗаказа,
	|             ТССтатистикаСкорости.ПричинаПростоя КАК ПричинаПростоя,
	|             ТССтатистикаСкорости.Оператор КАК Оператор,
	|             ТССтатистикаСкорости.Статус КАК Статус,
	|             ТССтатистикаСкорости.ЭтапПроизводства.НомерПроката КАК НомерПроката
	|ПОМЕСТИТЬ ВТ_ТекущееСостояниеМашин
	|ИЗ
	|             ВТ_ДатыПоследнихЗаписейМашинСПорядковымНомером КАК ВТ_ДатыПоследнихЗаписейМашинСПорядковымНомером
	|                             ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|                             ПО ВТ_ДатыПоследнихЗаписейМашинСПорядковымНомером.РабочийЦентр = ТССтатистикаСкорости.РабочийЦентр
	|                                             И ВТ_ДатыПоследнихЗаписейМашинСПорядковымНомером.ДатаНачала = ТССтатистикаСкорости.ДатаНачала
	|                                             И ВТ_ДатыПоследнихЗаписейМашинСПорядковымНомером.ПорядковыйНомер = ТССтатистикаСкорости.ПорядковыйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|             ВТ_ТекущееСостояниеМашин.РабочийЦентр КАК РабочийЦентр,
	|             ВТ_ТекущееСостояниеМашин.ЭтапПроизводства КАК ЭтапПроизводства,
	|             МАКСИМУМ(ТССтатистикаСкорости.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ДатаОкончанияПоследнейЗаписиПредыдущихСтатусов
	|ИЗ
	|             ВТ_ТекущееСостояниеМашин КАК ВТ_ТекущееСостояниеМашин
	|                             ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|                             ПО ВТ_ТекущееСостояниеМашин.РабочийЦентр = ТССтатистикаСкорости.РабочийЦентр
	|                                             И (ВТ_ТекущееСостояниеМашин.СтатусЗаказа <> ТССтатистикаСкорости.СтатусЗаказа
	|                                                             ИЛИ ВТ_ТекущееСостояниеМашин.ПричинаПростоя <> ТССтатистикаСкорости.ПричинаПростоя)
	|                                             И ВТ_ТекущееСостояниеМашин.ДатаНачала >= ТССтатистикаСкорости.ДатаНачала
	|
	|СГРУППИРОВАТЬ ПО
	|             ВТ_ТекущееСостояниеМашин.РабочийЦентр,
	|             ВТ_ТекущееСостояниеМашин.ЭтапПроизводства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|             ВТ_ДатаОкончанияПоследнейЗаписиПредыдущихСтатусов.РабочийЦентр КАК РабочийЦентр,
	|             ВТ_ДатаОкончанияПоследнейЗаписиПредыдущихСтатусов.ЭтапПроизводства КАК ЭтапПроизводства,
	|             МИНИМУМ(ТССтатистикаСкорости.ДатаНачала) КАК ДатаНачала
	|ПОМЕСТИТЬ ВТ_ДатыНачалаТекущихСтатусов
	|ИЗ
	|             ВТ_ДатаОкончанияПоследнейЗаписиПредыдущихСтатусов КАК ВТ_ДатаОкончанияПоследнейЗаписиПредыдущихСтатусов
	|                             ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|                             ПО ВТ_ДатаОкончанияПоследнейЗаписиПредыдущихСтатусов.РабочийЦентр = ТССтатистикаСкорости.РабочийЦентр
	|                                             И ВТ_ДатаОкончанияПоследнейЗаписиПредыдущихСтатусов.ЭтапПроизводства = ТССтатистикаСкорости.ЭтапПроизводства
	|                                             И ВТ_ДатаОкончанияПоследнейЗаписиПредыдущихСтатусов.ДатаОкончания <= ТССтатистикаСкорости.ДатаНачала
	|
	|СГРУППИРОВАТЬ ПО
	|             ВТ_ДатаОкончанияПоследнейЗаписиПредыдущихСтатусов.РабочийЦентр,
	|             ВТ_ДатаОкончанияПоследнейЗаписиПредыдущихСтатусов.ЭтапПроизводства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|             ВТ_ТекущееСостояниеМашин.РабочийЦентр КАК РабочийЦентр,
	|             ВТ_ТекущееСостояниеМашин.НомерБланка КАК НомерБланка,
	|             ВТ_ТекущееСостояниеМашин.ЭтапПроизводства КАК ЭтапПроизводства,
	|             ВТ_ТекущееСостояниеМашин.ПорядковыйНомер КАК ПорядковыйНомер,
	|             ВТ_ТекущееСостояниеМашин.ПричинаПростоя КАК ПричинаПростоя,
	|             ВТ_ТекущееСостояниеМашин.Оператор КАК Оператор,
	|             ВТ_ТекущееСостояниеМашин.Статус КАК Статус,
	|             МетрыПоЗаказамПлан.МетражДляРЦ КАК МетрыПлан,
	|             МетрыПоЗаказамФакт.ПоказанияОбщегоСчетчика КАК МетражОборот,
	|             МетрыПоЗаказамФакт.Длительность / 60 КАК Длительность,
	|             ВЫБОР
	|                             КОГДА ПоследниеЭтапыЗаказов.Этап = ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.КонтрольОТК)
	|                                             ТОГДА ""ОТК""
	|                             ИНАЧЕ ВТ_ТекущееСостояниеМашин.СтатусЗаказа
	|             КОНЕЦ КАК СтатусЗаказа,
	|             ВЫБОР
	|                             КОГДА ПоследниеЭтапыЗаказов.Этап = ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.КонтрольОТК)
	|                                             ТОГДА ПоследниеЭтапыЗаказов.Период
	|                             ИНАЧЕ ВТ_ДатыНачалаТекущихСтатусов.ДатаНачала
	|             КОНЕЦ КАК ДатаНачалаТекущегоСтатуса,
	|             МетрыПоЗаказамПлан.ВремяЗаказаПлан КАК ВремяЗаказаПлан,
	|             ВТ_ТекущееСостояниеМашин.Заказ.НомерБезПрефикса КАК Заказ
	|ИЗ
	|             ВТ_ТекущееСостояниеМашин КАК ВТ_ТекущееСостояниеМашин
	|                             ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыНачалаТекущихСтатусов КАК ВТ_ДатыНачалаТекущихСтатусов
	|                             ПО ВТ_ТекущееСостояниеМашин.РабочийЦентр = ВТ_ДатыНачалаТекущихСтатусов.РабочийЦентр
	|                                             И ВТ_ТекущееСостояниеМашин.ЭтапПроизводства = ВТ_ДатыНачалаТекущихСтатусов.ЭтапПроизводства
	|                             ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|                                             Лико_ЭтапыЗаказаСрезПоследних.Заказ КАК Заказ,
	|                                             МАКСИМУМ(Лико_ЭтапыЗаказаСрезПоследних.Этап) КАК Этап,
	|                                             МАКСИМУМ(Лико_ЭтапыЗаказаСрезПоследних.Период) КАК Период
	|                             ИЗ
	|                                             РегистрСведений.Лико_ЭтапыЗаказа.СрезПоследних(
	|                                                                            ,
	|                                                                            Заказ В
	|                                                                                            (ВЫБРАТЬ
	|                                                                                                            Т.Заказ
	|                                                                                            ИЗ
	|                                                                                                            ВТ_ТекущееСостояниеМашин КАК Т)) КАК Лико_ЭтапыЗаказаСрезПоследних
	|                             
	|                             СГРУППИРОВАТЬ ПО
	|                                             Лико_ЭтапыЗаказаСрезПоследних.Заказ) КАК ПоследниеЭтапыЗаказов
	|                             ПО ВТ_ТекущееСостояниеМашин.Заказ = ПоследниеЭтапыЗаказов.Заказ
	|                             ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|                                             Лико_ПараметрыПроизводстваЗаказа.Заказ КАК Заказ,
	|                                             Лико_ПараметрыПроизводстваЗаказа.НомерПроката КАК НомерПроката,
	|                                             МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ) КАК МетражДляРЦ,
	|                                             СУММА(Лико_ПараметрыПроизводстваЗаказа.ВремяПечати + Лико_ПараметрыПроизводстваЗаказа.ВремяНаНастройку + Лико_ПараметрыПроизводстваЗаказа.ВремяНаСменуРоликов) КАК ВремяЗаказаПлан
	|                             ИЗ
	|                                             РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|                                                             ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТекущееСостояниеМашин КАК ВТ_ТекущееСостояниеМашин
	|                                                             ПО Лико_ПараметрыПроизводстваЗаказа.Заказ = ВТ_ТекущееСостояниеМашин.Заказ
	|                                                                            И Лико_ПараметрыПроизводстваЗаказа.НомерПроката = ВТ_ТекущееСостояниеМашин.НомерПроката
	|                             
	|                             СГРУППИРОВАТЬ ПО
	|                                             Лико_ПараметрыПроизводстваЗаказа.Заказ,
	|                                             Лико_ПараметрыПроизводстваЗаказа.НомерПроката) КАК МетрыПоЗаказамПлан
	|                             ПО ВТ_ТекущееСостояниеМашин.Заказ = МетрыПоЗаказамПлан.Заказ
	|                                             И ВТ_ТекущееСостояниеМашин.НомерПроката = МетрыПоЗаказамПлан.НомерПроката
	|                             ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|                                             ТССтатистикаСкорости.РабочийЦентр КАК РабочийЦентр,
	|                                             ТССтатистикаСкорости.Заказ КАК Заказ,
	|                                             ТССтатистикаСкорости.ЭтапПроизводства КАК ЭтапПроизводства,
	|                                             СУММА(ТССтатистикаСкорости.ПоказанияОбщегоСчетчика) КАК ПоказанияОбщегоСчетчика,
	|                                             СУММА(ТССтатистикаСкорости.Длительность) КАК Длительность
	|                             ИЗ
	|                                             РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|                                                             ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТекущееСостояниеМашин КАК ВТ_ТекущееСостояниеМашин
	|                                                             ПО ТССтатистикаСкорости.РабочийЦентр = ВТ_ТекущееСостояниеМашин.РабочийЦентр
	|                                                                            И ТССтатистикаСкорости.ЭтапПроизводства = ВТ_ТекущееСостояниеМашин.ЭтапПроизводства
	|                             
	|                             СГРУППИРОВАТЬ ПО
	|                                             ТССтатистикаСкорости.Заказ,
	|                                             ТССтатистикаСкорости.ЭтапПроизводства,
	|                                             ТССтатистикаСкорости.РабочийЦентр) КАК МетрыПоЗаказамФакт
	|                             ПО ВТ_ТекущееСостояниеМашин.РабочийЦентр = МетрыПоЗаказамФакт.РабочийЦентр
	|                                             И ВТ_ТекущееСостояниеМашин.Заказ = МетрыПоЗаказамФакт.Заказ
	|                                             И ВТ_ТекущееСостояниеМашин.ЭтапПроизводства = МетрыПоЗаказамФакт.ЭтапПроизводства
	|ГДЕ
	|             ВТ_ТекущееСостояниеМашин.Заказ.НомерБезПрефикса В(&НомерЗаказа)";
	Запрос.УстановитьПараметр("НомераМашин",СписокНомеровМашин);
	Запрос.УстановитьПараметр("НомерЗаказа",НомераЗаказов);
	СтатистикаСкорости=Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТССтатистикаСкорости.МетражОборот КАК МетражОборот,
	|	ТССтатистикаСкорости.Длительность КАК Длительность,
	|	ТССтатистикаСкорости.РабочийЦентр КАК РабочийЦентр,
	|	ТССтатистикаСкорости.Заказ КАК Заказ
	|ПОМЕСТИТЬ ТССтатистикаСкорости
	|ИЗ
	|	&ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Заказ,
	|	ПооперационноеРасписание2_2.Начало КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА ПооперационноеРасписание2_2.РабочийЦентр.КоэффициентВремениРаботы <> 0
	|			ТОГДА ДОБАВИТЬКДАТЕ(ПооперационноеРасписание2_2.Начало, СЕКУНДА, РАЗНОСТЬДАТ(ПооперационноеРасписание2_2.Начало, ПооперационноеРасписание2_2.Окончание, СЕКУНДА) / ПооперационноеРасписание2_2.РабочийЦентр.КоэффициентВремениРаботы)
	|		ИНАЧЕ ПооперационноеРасписание2_2.Окончание
	|	КОНЕЦ КАК ДатаОкончания,
	|	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр,
	|	ЗаказКлиента.Z КАК Z,
	|	ЗаказКлиента.Нарезка КАК Нарезка,
	|	ПооперационноеРасписание2_2.РабочийЦентр.ПорядковыйНомер КАК РабочийЦентрНомер,
	|	ЗаказКлиента.ФормыСтрокой КАК Формы,
	|	ЗаказКлиента.ШтампыСтрокой КАК Оснастка,
	|	ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказа,
	|	ПооперационноеРасписание2_2.Этап.НомерПроката КАК НомерПередела,
	|	Лико_ОтображениеРабочихЦентровРабочиеЦентры.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВтЗаказ
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование = ЗаказКлиента.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ОтображениеРабочихЦентров.РабочиеЦентры КАК Лико_ОтображениеРабочихЦентровРабочиеЦентры
	|		ПО ПооперационноеРасписание2_2.РабочийЦентр = Лико_ОтображениеРабочихЦентровРабочиеЦентры.РабочийЦентр
	|ГДЕ
	|	Лико_ОтображениеРабочихЦентровРабочиеЦентры.Ссылка = &ОтображениеРабочихЦентров
	|	И ПооперационноеРасписание2_2.Выполнено = 0
	|	И НЕ ПооперационноеРасписание2_2.Моделирование
	|	И НЕ ПооперационноеРасписание2_2.Начало > &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ЗаказКлиентаЦвета.НомерСтроки) КАК НомерСтроки,
	|	ЗаказКлиентаЦвета.НомерВарианта КАК НомерВарианта,
	|	ВтЗаказ.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВтЗаказ КАК ВтЗаказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|		ПО ВтЗаказ.Заказ = ЗаказКлиентаЦвета.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаЦвета.НомерВарианта,
	|	ВтЗаказ.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаЦвета.Оснастка КАК Оснастка,
	|	ВТ.Заказ КАК Заказ,
	|	ЗаказКлиентаЦвета.НомерПроката КАК НомерПередела
	|ПОМЕСТИТЬ ВтЗаказНоменклатура
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|		ПО ВТ.Заказ = ЗаказКлиентаЦвета.Ссылка
	|			И ВТ.НомерВарианта = ЗаказКлиентаЦвета.НомерВарианта
	|ГДЕ
	|	ЗаказКлиентаЦвета.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НЕ ЗаказКлиентаЦвета.РабочийЦентр.ВидРабочегоЦентра В (ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Cartes), ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаЦвета.Вал КАК Оснастка,
	|	ВТ.Заказ КАК Заказ,
	|	ЗаказКлиентаЦвета.НомерПроката КАК НомерПередела
	|ПОМЕСТИТЬ ВтЗаказНоменклатураВалы
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|		ПО ВТ.Заказ = ЗаказКлиентаЦвета.Ссылка
	|			И ВТ.НомерВарианта = ЗаказКлиентаЦвета.НомерВарианта
	|ГДЕ
	|	ЗаказКлиентаЦвета.Вал <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НЕ ЗаказКлиентаЦвета.РабочийЦентр.ВидРабочегоЦентра В (ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Cartes), ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЗаказНоменклатура.Заказ КАК Заказ,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Количество,
	|	МИНИМУМ(ТоварыВЯчейкахОстатки.ВНаличииОстаток) КАК КоличествоОстаток,
	|	ВтЗаказНоменклатура.НомерПередела КАК НомерПередела
	|ПОМЕСТИТЬ ВтНоменклатураРЦ
	|ИЗ
	|	ВтЗаказНоменклатура КАК ВтЗаказНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Ячейка.Помещение = &ПомещениеПроизводство
	|					И Номенклатура В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВтЗаказНоменклатура.Оснастка
	|						ИЗ
	|							ВтЗаказНоменклатура КАК ВтЗаказНоменклатура)) КАК ТоварыВЯчейкахОстатки
	|		ПО ВтЗаказНоменклатура.Оснастка = ТоварыВЯчейкахОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЗаказНоменклатура.Заказ,
	|	ВтЗаказНоменклатура.НомерПередела
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЗаказНоменклатураВалы.Заказ КАК Заказ,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Количество,
	|	ВтЗаказНоменклатураВалы.НомерПередела КАК НомерПередела
	|ПОМЕСТИТЬ ВтНоменклатураРЦВалы
	|ИЗ
	|	ВтЗаказНоменклатураВалы КАК ВтЗаказНоменклатураВалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Ячейка.Помещение = &ПомещениеПроизводство
	|					И Номенклатура В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВтЗаказНоменклатура.Оснастка
	|						ИЗ
	|							ВтЗаказНоменклатураВалы КАК ВтЗаказНоменклатура)) КАК ТоварыВЯчейкахОстатки
	|		ПО ВтЗаказНоменклатураВалы.Оснастка = ТоварыВЯчейкахОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЗаказНоменклатураВалы.Заказ,
	|	ВтЗаказНоменклатураВалы.НомерПередела
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ТССтатистикаСкорости.МетражОборот) КАК МетражФакт,
	|	СУММА(ТССтатистикаСкорости.Длительность) КАК ВремяФакт,
	|	ВтЗаказ.РабочийЦентр КАК РабочийЦентр,
	|	ВтЗаказ.Заказ КАК Заказ,
	|	СУММА(Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ) КАК МетражПлан,
	|	СУММА(Лико_ПараметрыПроизводстваЗаказа.ВремяПечати + Лико_ПараметрыПроизводстваЗаказа.ВремяНаНастройку) КАК ВремяПлан
	|ПОМЕСТИТЬ ВтСтатистика
	|ИЗ
	|	ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЗаказ КАК ВтЗаказ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|			ПО ВтЗаказ.Заказ = Лико_ПараметрыПроизводстваЗаказа.Заказ
	|				И ВтЗаказ.РабочийЦентр = Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр
	|		ПО ТССтатистикаСкорости.Заказ = ВтЗаказ.Заказ.НомерБезПрефикса
	|			И ТССтатистикаСкорости.РабочийЦентр = ВтЗаказ.РабочийЦентр.ПорядковыйНомер
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЗаказ.РабочийЦентр,
	|	ВтЗаказ.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтЗаказ.Заказ КАК Заказ,
	|	Лико_ПередачаТоваровФормы.Форма КАК Форма,
	|	МАКСИМУМ(Лико_ПередачаТоваровФормы.Ссылка.Дата) КАК Дата
	|ПОМЕСТИТЬ ВтФормы
	|ИЗ
	|	ВтЗаказ КАК ВтЗаказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПередачаТоваров.Формы КАК Лико_ПередачаТоваровФормы
	|		ПО ВтЗаказ.Заказ = Лико_ПередачаТоваровФормы.Ссылка.ЗаказКлиента
	|			И (Лико_ПередачаТоваровФормы.Ссылка.ВидОперации = &ВидОперации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЗаказ.Заказ,
	|	Лико_ПередачаТоваровФормы.Форма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИСТИНА) КАК ЕстьФорма,
	|	ВтФормы.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВтВозвратФормЗаказ
	|ИЗ
	|	Документ.Лико_ВозвратТоваров.Формы КАК Лико_ВозвратТоваровФормы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтФормы КАК ВтФормы
	|		ПО Лико_ВозвратТоваровФормы.Форма = ВтФормы.Форма
	|			И (Лико_ВозвратТоваровФормы.Ссылка.ВидОперации = &ВидОперацииВозврат)
	|			И Лико_ВозвратТоваровФормы.Ссылка.Дата > ВтФормы.Дата
	|ГДЕ
	|	Лико_ВозвратТоваровФормы.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтФормы.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтФормы.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВтФормыЗаказ
	|ИЗ
	|	ВтФормы КАК ВтФормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтФормы.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЗаказ.Заказ КАК Заказ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИСТИНА) КАК ЕстьФлексоФорма,
	|	ЗаказКлиентаЦвета.НомерПроката КАК НомерПередела
	|ПОМЕСТИТЬ ВтЗакзыСФлексоФормами
	|ИЗ
	|	ВтЗаказ КАК ВтЗаказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|		ПО ВтЗаказ.Заказ = ЗаказКлиентаЦвета.Ссылка
	|ГДЕ
	|	ЗаказКлиентаЦвета.ВидСекции.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Флексо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЗаказ.Заказ,
	|	ЗаказКлиентаЦвета.НомерПроката
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЗаказ.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтНоменклатураРЦ.Количество, 1) > 0
	|				И ЕСТЬNULL(ВтНоменклатураРЦВалы.Количество, 1) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Оснастка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтЗакзыСФлексоФормами.ЕстьФлексоФорма, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВтВозвратФормЗаказ.ЕстьФорма ЕСТЬ NULL
	|						И НЕ ВтФормыЗаказ.Заказ ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК Форма,
	|	ВтЗаказ.РабочийЦентр КАК РабочийЦентр,
	|	ВтЗаказ.ДатаНачала КАК ДатаНачала,
	|	ВтЗаказ.НомерЗаказа КАК НомерЗаказа,
	|	ВтЗаказ.ДатаОкончания КАК ДатаОкончания,
	|	ВтЗаказ.РабочийЦентрНомер КАК РабочийЦентрНомер,
	|	ВтЗаказ.НомерСтроки КАК НомерСтроки,
	|	ВтСтатистика.МетражФакт КАК МетражФакт,
	|	ВтСтатистика.МетражПлан КАК МетражПлан,
	|	ВтСтатистика.ВремяПлан КАК ВремяПлан,
	|	ВЫБОР
	|		КОГДА ВтСтатистика.МетражПлан = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтСтатистика.МетражФакт / ВтСтатистика.МетражПлан * 100
	|	КОНЕЦ КАК ПроцентВыполнения,
	|	ВтСтатистика.ВремяФакт КАК ВремяФакт
	|ПОМЕСТИТЬ ВтИтог
	|ИЗ
	|	ВтЗаказ КАК ВтЗаказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНоменклатураРЦ КАК ВтНоменклатураРЦ
	|		ПО ВтЗаказ.Заказ = ВтНоменклатураРЦ.Заказ
	|			И ВтЗаказ.НомерПередела = ВтНоменклатураРЦ.НомерПередела
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
	|		ПО ВтЗаказ.Заказ = Лико_ПередачаТоваров.ЗаказКлиента
	|			И (Лико_ПередачаТоваров.ВидОперации = &ВидОперации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСтатистика КАК ВтСтатистика
	|		ПО ВтЗаказ.Заказ = ВтСтатистика.Заказ
	|			И ВтЗаказ.РабочийЦентр = ВтСтатистика.РабочийЦентр
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНоменклатураРЦВалы КАК ВтНоменклатураРЦВалы
	|		ПО ВтЗаказ.Заказ = ВтНоменклатураРЦВалы.Заказ
	|			И ВтЗаказ.НомерПередела = ВтНоменклатураРЦВалы.НомерПередела
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВозвратФормЗаказ КАК ВтВозвратФормЗаказ
	|		ПО ВтЗаказ.Заказ = ВтВозвратФормЗаказ.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтФормыЗаказ КАК ВтФормыЗаказ
	|		ПО ВтЗаказ.Заказ = ВтФормыЗаказ.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЗакзыСФлексоФормами КАК ВтЗакзыСФлексоФормами
	|		ПО ВтЗаказ.Заказ = ВтЗакзыСФлексоФормами.Заказ
	|			И ВтЗаказ.НомерПередела = ВтЗакзыСФлексоФормами.НомерПередела
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЗаказ.Заказ,
	|	ВтЗаказ.РабочийЦентр,
	|	ВтЗаказ.ДатаНачала,
	|	ВтЗаказ.НомерЗаказа,
	|	ВтЗаказ.ДатаОкончания,
	|	ВтЗаказ.РабочийЦентрНомер,
	|	ВтЗаказ.НомерСтроки,
	|	ВтСтатистика.МетражФакт,
	|	ВтСтатистика.МетражПлан,
	|	ВтСтатистика.ВремяПлан,
	|	ВЫБОР
	|		КОГДА ВтСтатистика.МетражПлан = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтСтатистика.МетражФакт / ВтСтатистика.МетражПлан * 100
	|	КОНЕЦ,
	|	ВтСтатистика.ВремяФакт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтНоменклатураРЦ.Количество, 1) > 0
	|				И ЕСТЬNULL(ВтНоменклатураРЦВалы.Количество, 1) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтЗакзыСФлексоФормами.ЕстьФлексоФорма, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВтВозвратФормЗаказ.ЕстьФорма ЕСТЬ NULL
	|						И НЕ ВтФормыЗаказ.Заказ ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтИтог.Заказ КАК Заказ,
	|	ЕСТЬNULL(ОснасткаКорр.Наличие, ВтИтог.Оснастка) КАК Оснастка,
	|	ЕСТЬNULL(ФормаКорр.Наличие, ВтИтог.Форма) КАК Форма,
	|	ВтИтог.РабочийЦентр КАК РабочийЦентр,
	|	ВтИтог.ДатаНачала КАК ДатаНачала,
	|	ВтИтог.НомерЗаказа КАК НомерЗаказа,
	|	ВтИтог.ДатаОкончания КАК ДатаОкончания,
	|	ВтИтог.РабочийЦентрНомер КАК РабочийЦентрНомер,
	|	ВтИтог.НомерСтроки КАК НомерСтроки,
	|	ВтИтог.МетражФакт КАК МетражФакт,
	|	ВтИтог.МетражПлан КАК МетражПлан,
	|	ВтИтог.ВремяПлан КАК ВремяПлан,
	|	ЕСТЬNULL(ВтИтог.ПроцентВыполнения, 0) КАК ПроцентВыполнения,
	|	ЕСТЬNULL(ВтИтог.ВремяФакт, 0) КАК ВремяФакт,
	|	ТС_ЗагрузкаРЦКомментарииСрезПоследних.Автор КАК Автор,
	|	ТС_ЗагрузкаРЦКомментарииСрезПоследних.Комментарий КАК Комментарий
	|ИЗ
	|	ВтИтог КАК ВтИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТС_ЗагрузкаРЦКомментарии.СрезПоследних КАК ТС_ЗагрузкаРЦКомментарииСрезПоследних
	|		ПО ВтИтог.Заказ = ТС_ЗагрузкаРЦКомментарииСрезПоследних.ЗаказПокупателя
	|			И ВтИтог.РабочийЦентр = ТС_ЗагрузкаРЦКомментарииСрезПоследних.РабочийЦентр
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТС_НаличееФормОснастки.СрезПоследних(, ТипМатериала = ЗНАЧЕНИЕ(Перечисление.Тс_ТипМатериалаИК.Форма)) КАК ФормаКорр
	|		ПО ВтИтог.Заказ = ФормаКорр.ЗаказПокупателя
	|			И ВтИтог.РабочийЦентр = ФормаКорр.РабочийЦентр
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТС_НаличееФормОснастки.СрезПоследних(, ТипМатериала = ЗНАЧЕНИЕ(Перечисление.Тс_ТипМатериалаИК.Оснастка)) КАК ОснасткаКорр
	|		ПО ВтИтог.Заказ = ОснасткаКорр.ЗаказПокупателя
	|			И ВтИтог.РабочийЦентр = ОснасткаКорр.РабочийЦентр
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийЦентрНомер,
	|	ДатаНачала";
	//Запрос.УстановитьПараметр("Владелец", Справочники.Пользователи.НайтиПоНаименованию("ТсМонитор"));
	Запрос.УстановитьПараметр("Владелец", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТССтатистикаСкорости",СтатистикаСкорости);
	Запрос.УстановитьПараметр("ОтображениеРабочихЦентров",ОтображениеРабочихЦентров);        
	Запрос.УстановитьПараметр("Дата1", НачалоПериода);
	Запрос.УстановитьПараметр("Дата2", КонецПериода+20*24*60*60);
	Запрос.УстановитьПараметр("ПомещениеПроизводство",Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПомещениеПроизводство"));
	Запрос.УстановитьПараметр("ВидОперации",Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм);
	Запрос.УстановитьПараметр("ВидОперацииВозврат",Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходФорм);

	 
	
	
	
	Возврат  Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

&Вместо("ФормыПечатьСкладскойОперации")
Функция Лико_ФормыПечатьСкладскойОперации(Ссылка, ПараметрыПечати, ПечататьОтправителя, КоличествоКопий, СразуНаПринтер)
    УстановитьПривилегированныйРежим(Истина);
	Формы= Ссылка.Формы.Выгрузить();
	Если Ссылка.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеФорм Тогда
		ПечататьОтправителя=Истина;
		Формы.Колонки["Конверт"].Имя = "КонвертОтправитель";
		Формы.Колонки["КонвертПолучатель"].Имя = "Конверт";

	КонецЕсли;


	ТабДок = Новый ТабличныйДокумент;             
	Запрос = Новый Запрос;
	Если ПечататьОтправителя Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|              ВнешнийИсточник.Конверт,
		|              ВнешнийИсточник.КонвертОтправитель КАК КонвертОтправитель,
		|              ВнешнийИсточник.Форма
		|ПОМЕСТИТЬ Формы
		|ИЗ
		|              &ВнешнийИсточник КАК ВнешнийИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|              Формы.Конверт КАК Конверт,
		|              Формы.КонвертОтправитель КАК КонвертОтправитель,
		|              ПОДСТРОКА(Формы.Форма.Код, 1, 7) КАК ОбщийКод,
		|              1 КАК КоличествоФорм,
		|              Формы.Форма
		|ИЗ
		|              Формы КАК Формы
		|ИТОГИ
		|              СУММА(КоличествоФорм)
		|ПО
		|              Конверт,
		|              КонвертОтправитель,
		|              ОбщийКод";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|              ВнешнийИсточник.Конверт,
		|              Значение(Справочник.Лико_Конверты.ПустаяСсылка) КАК КонвертОтправитель,
		|              ВнешнийИсточник.Форма
		|ПОМЕСТИТЬ Формы
		|ИЗ
		|              &ВнешнийИсточник КАК ВнешнийИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|              Формы.Конверт КАК Конверт,
		|              Формы.КонвертОтправитель КАК КонвертОтправитель,
		|              ПОДСТРОКА(Формы.Форма.Код, 1, 7) КАК ОбщийКод,
		|              1 КАК КоличествоФорм,
		|              Формы.Форма
		|ИЗ
		|              Формы КАК Формы
		|ИТОГИ
		|              СУММА(КоличествоФорм)
		|ПО
		|              Конверт,
		|              КонвертОтправитель,
		|              ОбщийКод";
	КонецЕсли;

	Запрос.УстановитьПараметр("ВнешнийИсточник", Формы);
	Запрос.УстановитьПараметр("ПечататьОтправителя", ПечататьОтправителя);

	ИмяПринтера = СокрЛП(Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ИмяПринтераЭтикеток", ""));
	Макет = ПолучитьОбщийМакет("Лико_ФормыКарточкаСкладскойОперации");
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");

	ВыборкаПоКонверту = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоКонверту.Следующий() Цикл

		ВыборкаПоКонвертуОтправителю = ВыборкаПоКонверту.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоКонвертуОтправителю.Следующий() Цикл

			ВыборкаПоГруппеФорм = ВыборкаПоКонвертуОтправителю.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			НомерКонверта=0;
			Пока ВыборкаПоГруппеФорм.Следующий() Цикл

				// параметры
				ПараметрыПечати.Вставить("КоличествоЕдиницаИзмерения", " " + ВыборкаПоГруппеФорм.КоличествоФорм + " форм.");
				ПараметрыПечати.Вставить("КодФормы", ВыборкаПоГруппеФорм.ОбщийКод);
				ПараметрыПечати.Вставить("Контрагент", Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса", ВыборкаПоГруппеФорм.ОбщийКод).Контрагент);
				//ПараметрыПечати.Вставить("Получатель", ?(ЗначениеЗаполнено(ПредопределенныйПолучатель), ПредопределенныйПолучатель, ВыборкаПоГруппеФорм.Конверт));
				Если ПараметрыПечати.Свойство("ОбщийПолучатель") Тогда
					ПараметрыПечати.Вставить("Получатель", "" + ПараметрыПечати.ОбщийПолучатель);
				Иначе
					ПараметрыПечати.Вставить("Получатель", "" + ВыборкаПоГруппеФорм.Конверт);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВыборкаПоГруппеФорм.КонвертОтправитель) Тогда
					ПараметрыПечати.Вставить("Получатель", Строка(ВыборкаПоГруппеФорм.Конверт) + " << "+ВыборкаПоГруппеФорм.КонвертОтправитель);
				КонецЕсли;
				ПараметрыПечати.Вставить("Дополнительное", "");

				// название всех форм общего кода одной строкой
				НазванияФормСтрокой = "";
				Выборка = ВыборкаПоГруппеФорм.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока Выборка.Следующий() Цикл
					НазванияФормСтрокой = НазванияФормСтрокой + ", " + СокрЛП(Выборка.Форма.Наименование);
				КонецЦикла;
				НазванияФормСтрокой = Сред(НазванияФормСтрокой, 3);
				ПараметрыПечати.Вставить("Формы", НазванияФормСтрокой);

				// формирование печати
				Если НомерКонверта>0 Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;


				ТабДокумент =ТабДок;
				ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Лико_ФормыКарточкаСкладскойОперации";

				ОбластьШапка.Параметры.Заполнить(ПараметрыПечати);
				ТабДокумент.Вывести(ОбластьШапка);

				ТабДокумент.АвтоМасштаб = Истина;
				ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
				ТабДокумент.ПолеСлева = 1;
				ТабДокумент.ПолеСправа = 0;
				ТабДокумент.ПолеСнизу = 0;
				ТабДокумент.ПолеСверху = 1;

				ТабДокумент.ИмяПринтера = ИмяПринтера;

				НомерКонверта=НомерКонверта+1;

			КонецЦикла;

		КонецЦикла;

	КонецЦикла;
	Возврат ТабДокумент; 
КонецФункции

&Вместо("ПолучитьАдресХраненияПоСерии")
Функция Лико_ПолучитьАдресХраненияПоСерии(Серия, Дата, СкладСИМ)
	Если СкладСИМ=Неопределено Тогда
		СкладСИМ=ПараметрыСеанса.Лико_РабочееМесто.СкладСИМ;
	КонецЕсли;
	Организация =СкладСИМ.Лико_Площадка.Организация; 

	Ячейка=Неопределено;
	Если не ЗначениеЗаполнено(Серия) Тогда
		Возврат Ячейка;
	КонецЕсли;
	//ОбъектыНоменклатуры= Серия.ОбъектНоменклатуры;
	Если ЗначениеЗаполнено(Дата) Тогда
		ТекстЗапроса= "ВЫБРАТЬ
		              |	Остатки.Ячейка КАК Ячейка
		              |ИЗ
		              |	РегистрНакопления.ТоварыВЯчейках.Остатки(&Дата, Серия = &Серия) КАК Остатки
		              |ГДЕ
		              |	Остатки.Серия = &Серия";
					  //|	И (Остатки.Ячейка.Лико_Организация = &Организация
					  //|			ИЛИ Остатки.Ячейка.Лико_ОрганизацияОтветственногоХранения = &Организация)";
	Иначе
		
		ТекстЗапроса= "ВЫБРАТЬ
		              |	Остатки.Ячейка КАК Ячейка
		              |ИЗ
		              |	РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия = &Серия) КАК Остатки
		              |ГДЕ
		              |	Остатки.Серия = &Серия";
					  //|	И (Остатки.Ячейка.Лико_Организация = &Организация
					  //|			ИЛИ Остатки.Ячейка.Лико_ОрганизацияОтветственногоХранения = &Организация)"; 
	КонецЕсли;        
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;  

	Запрос.УстановитьПараметр("Серия",Серия );
	Запрос.УстановитьПараметр("Дата",Дата );
	Запрос.УстановитьПараметр("Организация",Организация);


	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл                       
		//Возврат Выборка.Ячейка;
		Ячейка= Выборка.Ячейка;
		Прервать;
	КонецЦикла;  
	Если Выборка.Количество()<>1 ТОгда
		Ячейка=Неопределено;             
	КонецЕсли;


	Возврат Ячейка;             
КонецФункции

&Вместо("ПолучитьАдресХраненияПоСерииМассив")
Функция Лико_ПолучитьАдресХраненияПоСерииМассив(Серия, Дата, СкладСИМ)
	Если СкладСИМ=Неопределено Тогда
		СкладСИМ=ПараметрыСеанса.Лико_РабочееМесто.СкладСИМ;
	КонецЕсли;
    	Организация =СкладСИМ.Лико_Площадка.Организация;

	Ячейка=Неопределено;
	Если не ЗначениеЗаполнено(Серия) Тогда
		Возврат Ячейка;
	КонецЕсли;
	//ОбъектыНоменклатуры= Серия.ОбъектНоменклатуры;
	//Если ЗначениеЗаполнено(Дата) Тогда
	//	ТекстЗапроса= "ВЫБРАТЬ Остатки.Ячейка КАК Ячейка ИЗ РегистрНакопления.ТоварыВЯчейках.Остатки(&Дата, Серия = &Серия) КАК Остатки
	//	|ГДЕ      Остатки.Серия = &Серия  И Остатки.Ячейка.Владелец=&Склад ";
	//Иначе
	//	ТекстЗапроса= "ВЫБРАТЬ Остатки.Ячейка КАК Ячейка ИЗ РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия = &Серия) КАК Остатки
	//	|ГДЕ      Остатки.Серия = &Серия И Остатки.Ячейка.Владелец=&Склад "; 
	//КонецЕсли; 
	
	
	Если ЗначениеЗаполнено(Дата) Тогда
		ТекстЗапроса= "ВЫБРАТЬ
		              |	Остатки.Ячейка КАК Ячейка
		              |ИЗ
		              |	РегистрНакопления.ТоварыВЯчейках.Остатки(&Дата, Серия = &Серия) КАК Остатки
		              |ГДЕ
		              |	Остатки.Серия = &Серия
		              |	И (Остатки.Ячейка.Лико_Организация = &Организация
		              |			ИЛИ Остатки.Ячейка.Лико_ОрганизацияОтветственногоХранения = &Организация)";
	Иначе
		
		ТекстЗапроса= "ВЫБРАТЬ
		              |	Остатки.Ячейка КАК Ячейка
		              |ИЗ
		              |	РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия = &Серия) КАК Остатки
		              |ГДЕ
		              |	Остатки.Серия = &Серия
		              |	И (Остатки.Ячейка.Лико_Организация = &Организация
		              |			ИЛИ Остатки.Ячейка.Лико_ОрганизацияОтветственногоХранения = &Организация)"; 
	КонецЕсли;        

	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;  

	Запрос.УстановитьПараметр("Серия",Серия );
	Запрос.УстановитьПараметр("Дата",Дата );
	Запрос.УстановитьПараметр("Организация",Организация);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Массив = Новый Массив();
	Пока Выборка.Следующий() Цикл                       
		Массив.Добавить(Выборка.Ячейка);  
	КонецЦикла;  


	Возврат Массив;             
КонецФункции
